app/controllers/empresas_controller.rb

  def index
    @empresas = Empresa.all
---
SELECT * FROM "empresas"

  def show
    @empresa = Empresa.find(params[:id])
---
SELECT * FROM "empresas" WHERE ("empresas"."id" = 1)

  def edit
    @empresa = Empresa.find(params[:id])
---
SELECT * FROM "empresas" WHERE ("empresas"."id" = 4)

  def create
    @empresa = Empresa.new(params[:empresa])

    respond_to do |format|
      if @empresa.save
---
INSERT INTO "empresas" ("nombreEmpresa", "updated_at", "logotipo", "mensaje", "created_at") VALUES('s', '2010-03-10 22:29:12', 's', 's', '2010-03-10 22:29:12')

  def update
    @empresa = Empresa.find(params[:id])
---
SELECT * FROM "empresas" WHERE ("empresas"."id" = 4)