app/controllers/estudiantes_controller.rb

SELECT * FROM "estudiantes"
---
  def index
    @estudiantes = Estudiante.all

SELECT * FROM "estudiantes" WHERE ("estudiantes"."id" = 1)
---
  def show
    @estudiante = Estudiante.find(params[:id])

SELECT * FROM "estudiantes" WHERE ("estudiantes"."id" = 1)
---
  def edit
    @estudiante = Estudiante.find(params[:id])

INSERT INTO "estudiantes" ("nombreEstudiante1", "nombreEstudiante2", "matriculaEstudiante1", "updated_at", "matriculaEstudiante2", "matriculaEstudiante3", "email1", "email2", "email3", "nombreEsudiante3", "nombreUniversidad", "created_at") VALUES('s', 's@d.com', 's@d.com', '2010-03-10 23:25:49', 's@d.com', 's@d.com', 's@d.com', 's@d.com', 's@d.com', 's@d.com', 's', '2010-03-10 23:25:49')
---
  def create
    @estudiante = Estudiante.new(params[:estudiante])

    respond_to do |format|
      if @estudiante.save

SELECT * FROM "estudiantes" WHERE ("estudiantes"."id" = 1)
UPDATE "estudiantes" SET "matriculaEstudiante1" = '11122-33', "nombreUniversidad" = 'Universidad Iberoamericana', "nombreEstudiante1" = 'jose Luis Castillo de caveza de vaca', "updated_at" = '2010-03-04 23:42:58' WHERE "id" = 3
---
  def update
    @estudiante = Estudiante.find(params[:id])

    respond_to do |format|
      if @estudiante.update_attributes(params[:estudiante])

SELECT * FROM "estudiantes" WHERE ("estudiantes"."id" = 2)
DELETE FROM "estudiantes" WHERE "id" = 2
---
  def destroy
    @estudiante = Estudiante.find(params[:id])
    @estudiante.destroy