app/controllers/generals_controller.rb

  def index
    @generals = General.all
---
SELECT * FROM "generals"

  def show
    @general = General.find(params[:id])
---
SELECT * FROM "generals" WHERE ("generals"."id" = 1)

  def edit
    @general = General.find(params[:id])
---
SELECT * FROM "generals" WHERE ("generals"."id" = 1)

  def create
    @general = General.new(params[:general])

    respond_to do |format|
      if @general.save
---
INSERT INTO "generals" ("nombreIntegrante1", "logotipo", "nombreIntegrante2", "created_at", "photo_file_size", "nombreEmpresa", "nombreIntegrante3", "updated_at", "photo_file_name", "photo_content_type", "photo_updated_at") VALUES('j', NULL, 'j', '2010-03-05 17:59:50', 157051, 'Prueba', 'j', '2010-03-05 17:59:50', 'DSC03596.JPG', 'image/jpeg', '2010-03-05 17:59:46')

  def update
    @general = General.find(params[:id])

    respond_to do |format|
      if @general.update_attributes(params[:general])
---
SELECT * FROM "generals" WHERE ("generals"."id" = 1)
UPDATE "generals" SET "logotipo" = 'h', "nombreIntegrante3" = 'h', "nombreIntegrante2" = 'h', "nombreEmpresa" = 'h', "nombreIntegrante1" = 'h', "updated_at" = '2010-03-04 21:58:05' WHERE "id" = 11

  def destroy
    @general = General.find(params[:id])
    @general.destroy
---
SELECT * FROM "generals" WHERE ("generals"."id" = 4)
DELETE FROM "generals" WHERE "id" = 4