app/controllers/publicos_controller.rb

  def index
    @publicos = Publico.all
---
SELECT * FROM "publicos"

  def show
    @publico = Publico.find(params[:id])
---
SELECT * FROM "publicos" WHERE ("publicos"."id" = 0)